# ETL Project

In [2]:
#Dependencies
import pandas as pd
from sqlalchemy import create_engine

## Extract CSVs into DataFrame

In [3]:
#Read in top250 file and view dataframe 
top250_file = "data/Top250.csv"
top250 = pd.read_csv(top250_file)
top250.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [4]:
#Read in future50 file and view dataframe 
future50_file = "data/Future50.csv"
future50 = pd.read_csv(future50_file)
future50.head()

,Rank,Restaurant,Location,Sales,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [5]:
#Read in Independence100 file and view dataframe 
ind100_file = "data/Independence100.csv"
ind100 = pd.read_csv(ind100_file)
ind100.head()

,Rank,Restaurant,Sales,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39080335.0,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35218364.0,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29104017.0,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26916180.0,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26900000.0,62,New York,N.Y.,403000.0

## Transform DataFrames

In [6]:
#Drop any null values

#Rename any columns

#Make the Sales units match across tables

### Join Future50 and Ind100 on location

In [16]:
# Step 1. Make a copy of Future 50 df
future50_df = future50.copy()
future50_df.head()

<bound method NDFrame.head of     Rank                        Restaurant                  Location  Sales  \
0      1                        Evergreens            Seattle, Wash.     24
1      2                       Clean Juice           Charlotte, N.C.     44
2      3                          Slapfish  Huntington Beach, Calif.     21
3      4                        Clean Eatz          Wilmington, N.C.     25
4      5                         Pokeworks            Irvine, Calif.     49
5      6                       Playa Bowls             Belmar,  N.J.     39
6      7                  The Simple Greek            Blue Bell, Pa.     24
7      8                         Melt Shop            New York, N.Y.     20
8      9                        Creamistry      Yorba Linda,  Calif.     24
9     10              Joella's Hot Chicken           Louisville, Ky.     29
10    11                     Eggs Up Grill         Spartanburg, S.C.     30
11    12                          Dog Haus          Pasadena, Calif.     39
12    13                  Teriyaki Madness             Denver, Colo.     41
13    14                    Bluestone Lane            New York, N.Y.     48
14    15                 Original ChopShop              Plano, Texas     21
15    16                 Rapid Fired Pizza           Kettering, Ohio     24
16    17           Ike's Love & Sandwiches     San Francisco, Calif.     44
17    18                    Vitality Bowls         San Ramon, Calif.     37
18    19         Hawkers Asian Street Fare             Orlando, Fla.     22
19    20          Maple Street Biscuit Co.         Orange Park, Fla.     39
20    21                   Bulla Gastrobar               Doral, Fla.     32
21    22                       Duck Donuts        Mechanicsburg, Pa.     44
22    23                   The Little Beet            New York, N.Y.     23
23    24                   Joe & The Juice            New York, N.Y.     47
24    25                          By Chloe            New York, N.Y.     37
25    26              Sugarfire Smokehouse             Olivette, Mo.     39
26    27               Bibibop Asian Grill            Columbus, Ohio     44
27    28               Bubbakoo's Burritos       Wall Township, N.J.     28
28    29                Dos Toros Taqueria            New York, N.Y.     28
29    30                   The Pizza Press           Anaheim, Calif.     27
30    31                    The Lost Cajun             Frisco, Texas     20
31    32                        Just Salad            New York, N.Y.     42
32    33        Jeni's Splendid Ice Creams            Columbus, Ohio     42
33    34                          Boqueria            New York, N.Y.     27
34    35         Quickway Japanese Hibachi              Fairfax, Va.     22
35    36                         Surcheros              Douglas, Ga.     22
36    37                   Famous Toastery           Charlotte, N.C.     40
37    38                  Culinary Dropout         Scottsdale, Ariz.     20
38    39                     Condado Tacos            Columbus, Ohio     38
39    40           The Flying Biscuit Cafe              Atlanta, Ga.     29
40    41             Blue Sushi Sake Grill               Omaha, Neb.     49
41    42                    The Human Bean             Medford, Ore.     47
42    43   Spitz Mediterranean Street Food       Los Angeles, Calif.     28
43    44                      Tacos 4 Life              Conway, Ark.     25
44    45    Pita Mediterranean Street Food             Fairburn, Ga.     38
45    46                       LA Crawfish            McAllen, Texas     48
46    47                            &pizza          Washington, D.C.     45
47    48               Super Duper Burgers     San Francisco, Calif.     39
48    49                   StoneFire Grill      Agoura Hills, Calif.     31
49    50  Gus's World Famous Fried Chicken            Memphis, Tenn.     44

   YOY_Sales  Units YOY_Units  Unit_Volume Franchising
0     130.5%     26    116.7%         1150          No
1     121.9%    105     94.4%          560         Yes
2      81.0%     21     90.9%         1370         Yes
3      79.7%     46     58.6%          685         Yes
4      77.1%     50     56.3%         1210         Yes
5      62.9%     76     28.8%          580         Yes
6      52.5%     36     33.3%          775         Yes
7      39.6%     19     35.7%         1260         Yes
8      36.8%     60     27.7%          465         Yes
9      35.5%     17     30.8%         1930          No
10     35.4%     41     36.7%          860         Yes
11     34.5%     50     42.9%         1200         Yes
12     34.1%     63     65.8%          890         Yes
13     33.0%     48     37.1%         1175          No
14     32.5%     12     20.0%         1930          No
15     32.2%     35     29.6%          780         Yes
16     30.8%     71     29.1%          700         Yes
17     30.1%     77     24.2%          535         Yes
18     30.0%      7     40.0%         3800          No
19     28.9%     33     10.0%         1260         Yes
20     28.2%      8     14.3%         4300          No
21     28.0%     90     16.9%          530         Yes
22     26.5%     12     33.3%         2230          No
23     25.9%     69     25.5%          760         Yes
24     25.6%     14      7.7%         2800          No
25     25.4%     15     15.4%         2820          No
26     24.6%     37     23.3%         1330          No
27     24.3%     31     14.8%          970         Yes
28     24.0%     22     10.0%         1375          No
29     23.7%     27     22.7%         1130         Yes
30     23.0%     26      4.0%          785         Yes
31     22.7%     38     26.7%         1240          No
32     22.4%     44     22.2%         1050          No
33     22.0%      7     16.7%         4260          No
34     21.4%     25     19.0%          985         Yes
35     21.3%     20     17.6%         1230         Yes
36     21.2%     27      8.0%         1540         Yes
37     20.8%      7     16.7%         3120          No
38     19.9%     15     15.4%         2755          No
39     19.5%     21     16.7%         1510         Yes
40     19.5%     14     16.7%         3500          No
41     19.0%     97     19.8%          535         Yes
42     18.8%     11     10.0%         2700          No
43     18.4%     16      6.7%         1620         Yes
44     17.8%     32     10.3%         1260         Yes
45     17.6%     25     13.6%         2050         Yes
46     17.1%     35      9.4%         1350          No
47     16.9%     16     14.3%         2630          No
48     16.0%     13      8.3%         2550          No
49     14.4%     28      7.7%         1600         Yes  >

In [8]:
# Step 2 Split Future50 Locations into cities and states columns into a new df
future50_split = future50_df["Location"].str.split(",", n = 1, expand = True)
future50_split.head()

                  0        1
0           Seattle    Wash.
1         Charlotte     N.C.
2  Huntington Beach   Calif.
3        Wilmington     N.C.
4            Irvine   Calif.

In [9]:
# Step 3 Create City and State columns on existing future50_df then drop the Location column
future50_df["City"]= future50_split[0]
future50_df["State"]= future50_split[1]
future50_df = future50_df.drop(columns = ['Location'])
future50_df.head()

,Rank,Restaurant,Sales,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising,City,State
0,1,Evergreens,24,130.5%,26,116.7%,1150,No,Seattle,Wash.
1,2,Clean Juice,44,121.9%,105,94.4%,560,Yes,Charlotte,N.C.
2,3,Slapfish,21,81.0%,21,90.9%,1370,Yes,Huntington Beach,Calif.
3,4,Clean Eatz,25,79.7%,46,58.6%,685,Yes,Wilmington,N.C.
4,5,Pokeworks,49,77.1%,50,56.3%,1210,Yes,Irvine,Calif.

In [10]:
# Step 4 Join Future50 and Ind100 on location
ind100.head()

,Rank,Restaurant,Sales,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39080335.0,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35218364.0,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29104017.0,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26916180.0,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26900000.0,62,New York,N.Y.,403000.0

In [ ]:
#Aggregate Ind100 by summing (sales or meals) to find overall top

#Grouby Restaurant, summing by (sales or meals)

#Set rank to index

#Reset index to show new rank

## Load DataFrames into Database

In [12]:
# Import pgadmin password from python file
from etlpw import pw

In [13]:
# Create Database Connection
engine = create_engine(f'postgresql://postgres:{pw}@localhost:5432/restaurant_db')
#engine = create_engine(f'postgresql://{connection_string}')

In [14]:
# Confirm tables
engine.table_names()

['future50', 'ind100', 'top250']

In [20]:
# Add dataframes to sql for Future 50 df.
future50.to_sql(name='future50', con=engine, if_exists='append', index=False)

In [21]:
# Add dataframes to sql for ind100 df.
ind100.to_sql(name='ind100', con=engine, if_exists='append', index=False)

In [22]:
# Add dataframes to sql for top250 df.
top250.to_sql(name='top250', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_location table

In [15]:
pd.read_sql_query('select * from ind100', con=engine).head()

,Rank,Restaurant,Sales,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39080335.0,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35218364.0,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29104017.0,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26916180.0,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26900000.0,62,New York,N.Y.,403000.0